In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'P':[11,22,np.nan],
                  'M':[5,np.nan,np.nan],
                  'N':[11,122,33]})

In [4]:
df

      P    M    N
0  11.0  5.0   11
1  22.0  NaN  122
2   NaN  NaN   33

In [5]:
df.dropna()

      P    M   N
0  11.0  5.0  11

In [6]:
df.dropna(axis=1)

     N
0   11
1  122
2   33

In [7]:
df.dropna(thresh=2)

      P    M    N
0  11.0  5.0   11
1  22.0  NaN  122

In [8]:
df.fillna(value='some value')

            P           M    N
0        11.0         5.0   11
1        22.0  some value  122
2  some value  some value   33

In [12]:
df['P'] = df['P'].fillna(value=df['P'].mean())

In [15]:
df

      P    M    N     A
0  11.0  5.0   11  11.0
1  22.0  NaN  122  22.0
2  16.5  NaN   33  16.5